---
kind: property
id: P:Autodesk.Revit.DB.GroupTypeId.Pattern
source: html/54533628-fdf0-ae4d-2ff2-85583e083ac3.htm
---
# Autodesk.Revit.DB.GroupTypeId.Pattern Property

Pattern.

## Syntax (C#)
```csharp
public static ForgeTypeId Pattern { get; }
```